import React from "react";
import Pagination from "../../../components/Pagination";
import { Link } from "react-router-dom";

export default function News() {
    const [news, setNews] = React.useState([
        {
            image: "../img/example.jpg",
            title: "Название новости",
            description:
                "Это командная тактико-стратегическая игра с элементами компьютерной ролевой игры, в которой каждый игрок управляет одним героем, и, если герой имеет соответствующие способности, некоторым количеством дополнительных существ.",
        },
        {
            image: "../img/example.jpg",
            title: "Название новости",
            description:
                "Это командная тактико-стратегическая игра с элементами компьютерной ролевой игры, в которой каждый игрок управляет одним героем, и, если герой имеет соответствующие способности, некоторым количеством дополнительных существ.",
        },
        {
            image: "../img/example.jpg",
            title: "Название новости",
            description:
                "Это командная тактико-стратегическая игра с элементами компьютерной ролевой игры, в которой каждый игрок управляет одним героем, и, если герой имеет соответствующие способности, некоторым количеством дополнительных существ.",
        },
        {
            image: "../img/example.jpg",
            title: "Название новости",
            description:
                "Это командная тактико-стратегическая игра с элементами компьютерной ролевой игры, в которой каждый игрок управляет одним героем, и, если герой имеет соответствующие способности, некоторым количеством дополнительных существ.",
        },
        {
            image: "../img/example.jpg",
            title: "Название новости",
            description:
                "Это командная тактико-стратегическая игра с элементами компьютерной ролевой игры, в которой каждый игрок управляет одним героем, и, если герой имеет соответствующие способности, некоторым количеством дополнительных существ.",
        },
    ]);
    return (
        <div className="AdminNews">
            <Link to={"../admin-panel/news_create"}>Создать новость +</Link>
            <div className="list">
                {news.map((value, i) => (
                    <div key={"admin-news-page-team-" + i}>
                        <img alt="Изображение новости" src={value.image} />
                        <div className="description">
                            <h3>{value.title}</h3>
                            <p>{value.description}</p>
                        </div>
                        <div className="buttons">
                            <button className="green">Редактировать</button>
                            <button className="red">Удалить</button>
                        </div>
                    </div>
                ))}
            </div>
            <Pagination />
        </div>
    );
}
